-- phpMyAdmin SQL Dump
-- version 4.3.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Dec 04, 2016 at 03:30 AM
-- Server version: 5.6.24
-- PHP Version: 5.6.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `movieplus_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `cinema`
--

CREATE TABLE IF NOT EXISTS `cinema` (
  `cid` int(11) NOT NULL,
  `cname` text NOT NULL,
  `location` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `cinema`
--

INSERT INTO `cinema` (`cid`, `cname`, `location`) VALUES
(1, 'Ladkrabang Cinema', 'ลาดกระบัง'),
(2, 'Hua Takhe Cinema', 'หัวตะเข้'),
(3, 'Seansuk Cinema', 'แสนสุข'),
(4, 'Rung Arun Cinema', 'รุ่งอรุณ');

-- --------------------------------------------------------

--
-- Table structure for table `movie`
--

CREATE TABLE IF NOT EXISTS `movie` (
  `mid` int(11) NOT NULL,
  `mname` mediumtext NOT NULL,
  `detail` mediumtext NOT NULL,
  `poster` mediumtext NOT NULL,
  `trailer` text NOT NULL,
  `type` text NOT NULL,
  `mtime` text NOT NULL,
  `director` text NOT NULL,
  `status` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `movie`
--

INSERT INTO `movie` (`mid`, `mname`, `detail`, `poster`, `trailer`, `type`, `mtime`, `director`, `status`) VALUES
(1, 'Inferno โลกันตนรก', 'ศาสตราจารย์โรเบิร์ต แลงดอน นักสัญลักษณ์วิทยาคนดัง (รับบทโดยทอม แฮงค์ส) ต้องตามรอยเงื่อนงำที่เกี่ยวพันกับ "Inferno" ผลงานชิ้นเอกของดันเต้เพื่อหยุดยั้งแผนการฆ่าล่างเผ่าพันธุ์มนุษย์จากวายร้ายสติเฟื่อง ทว่าเขากลับฟื้นขึ้นมาในโรงพยาบาลแห่งหนึ่งในอิตาลีด้วยอาการความจำเสื่อม และถูกตามล่าหมายชีวิต เขาได้ร่วมมือกับเซียนนา บรู๊คส์ (เฟลิซิตี้ โจนส์) คุณหมอที่เขาหวังว่าจะช่วยเขารื้อฟื้นความทรงจำได้สำเร็จ พวกเขาเดินทางไปทั่วยุโรปโดยแข่งกับเวลาเพื่อหยุดยั้งไม่ให้ไวรัสร้ายที่จะคร่าชีวิตประชากรครึ่งโลกถูกปลดปล่อยออกมา', 'https://upload.wikimedia.org/wikipedia/th/thumb/d/de/Inferno_Tom_Hanks_Felicity_Jones_film_poster.jpg/250px-Inferno_Tom_Hanks_Felicity_Jones_film_poster.jpg', 'https://youtu.be/aVBdeeXuXLU', 'ระทึกขวัญ', '121', 'Ron Howard', 'show now'),
(2, 'Doctor Strange จอมเวทย์มหากาฬ', 'Doctor Strange จะว่าด้วยเรื่องราวของนายแพทย์ศัลยประสาทที่ประสบอุบัติเหตุจนได้ค้นพบกกับโลกเวทมนตร์และพลังเร้นลับ ภาพยนตร์กำกับ โดย Scott Derrickson และได้  Benedict Cumberbatch  รับบทเป็น Stephen Strange หรือ Doctor Strange พร้อมจะมาถล่มความมันส์ใน เฟส 3 ต่อจาก Captain America: Civil War', 'https://upload.wikimedia.org/wikipedia/th/thumb/c/c7/Doctor_Strange_poster.jpg/250px-Doctor_Strange_poster.jpg', 'https://youtu.be/ErILV5bNv6c', 'แอ็คชัน / วิทยาศาสตร์', '115', 'Scott Derrickson', 'show now'),
(3, 'Jack Reacher 2 ยอดคนสืบระห่ำ 2', 'แจ็ค รีชเชอร์ (ทอม ครูซ) กลับมาเพื่อพิทักษ์ความยุติธรรมใน Jack Reacher: Never Go Back ยอดคนสืบระห่ำ 2 เมื่อ ซูซาน เทอร์เนอร์ (โคบี้ สมัลเดอร์) เจ้าหน้าที่กองทัพในหน่วยสืบสวนเดิมที่เขาเคยอยู่ ถูกจับในข้อหาขายชาติ รีชเชอร์จึงกลับมาเพื่อหยุดยั้งกระบวนการและช่วยพิสูจน์ว่าเธอบริสุทธิ์ พร้อมเปิดโปงความจริงเบื้องหลังแผนการสมคบคิดที่เกี่ยวข้องกับทหารที่ถูกฆ่า', 'https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Jack_Reacher_Never_Go_Back_poster.jpg/220px-Jack_Reacher_Never_Go_Back_poster.jpg', 'https://youtu.be/ysxtHc2cJw8', 'แอ็คชัน', '118', 'Edward Zwick', 'show now'),
(4, 'The Accountant อัจฉริยะคนบัญชีเพชฌฆาต', 'เป็นเรื่องราวของคริสเตียน วูลฟ์ เป็นอัจฉริยะด้านคณิตศาสตร์ที่ผูกพันกับตัวเลขมากกว่าผู้คน เขาเปิดสำนักงานบัญชีในเมืองเล็กๆ เพื่อใช้เป็นฉากบังหน้า แต่เบื้องหลังเขาเป็นนักบัญชีอิสระให้บรรดาแก๊งอาชญากรที่อันตรายที่สุดในโลก เมื่อฝ่ายปราบปรามอาชญากรรมของกระทรวงการคลังซึ่งนำโดย เรย์ คิง เริ่มแกะรอยใกล้เข้ามา คริสเตียนจึงรับงานจากลูกค้าถูกกฎหมายเป็นบริษัทหุ่นยนต์ซึ่งมีเทคโนโลยีอันล้ำสมัย พนักงานบัญชีของบริษัทแห่งนี้ ค้นพบว่ามีตัวเลขส่วนต่างนับหลายล้านเหรียญ แต่ขณะที่คริสเตียนหาร่องรอยในบัญชีจนเข้าใกล้ความจริง ตัวเลขที่เพิ่มขึ้นเรื่อยๆ กลับกลายเป็นจำนวนศพ', 'https://upload.wikimedia.org/wikipedia/en/thumb/e/e4/The_Accountant_%282016_film%29.png/220px-The_Accountant_%282016_film%29.png', 'https://youtu.be/SUrS2qlsa1E', 'แอ็คชัน', '128', 'Gavin O''Connor', 'show now'),
(5, 'The Nursery เนอสเซอรี่เลี้ยงผี', 'ในช่วงปลายราชวงศ์หยวน ผู้คนนิยมกินเนื้อกันอย่างแพร่หลาย โดยเฉพาะอย่างยิ่งเนื้อของเด็กทารก หมู่บ้านหลินถาง ที่อยู่ติดกับแม่น้้าฮวาย ได้รับความเดือดร้อนจากเหล่าทหารที่เคลื่อนทัพผ่านมาและเข้ายึดหมู่บ้าน ในคืนนั้นเองทหารได้จับเด็กทารกในหมู่บ้านมาทำเป็นอาหารเลี้ยงกองทัพ หลังจากนั้นเหล่าบรรดาแม่ที่สูญเสียลูกจึงทำพิธีเรียกวิญญาณของเด็กทารกที่โดนฆ่าให้กลับมาแก้แค้น ผ่านไปหลายร้อยปี เหมิง เส้าฮุย จิตกรหนุ่มผู้ซึ่งเกิดในหมู่บ้านหลินถางแต่ได้ย้ายออกมาอยู่เมืองใหญ่ตั้งแต่ยังเด็ก ด้วยการที่เค้าสูญเสียความทรงจ้าบางอย่างในวัยเด็กไป ท้าให้เขาตัดสินใจกลับไปที่หมู่บ้านหลินถางเพื่อตามหาความจริง โดยมี เหย่ จื่อเฟย (มิน พีชญา) แฟนสาวของ เหมิง เส้าฮุย ที่ออกติดตามคนรัก เพื่อกลับไปที่ ๆ เรื่องราวต่าง ๆ เริ่มต้น ท้าให้ทั้งคู่ได้พบเจอกับเรื่องมากมาย และเบื้องหลังความลับอันด้ามืดก็ค่อย ๆ เผยตัวออกมา', 'https://t1.gstatic.com/images?q=tbn:ANd9GcQG6dPe39NI5CxOZs0qE44tVQZCl4MdbMM-WXKOUrTVQHV8Tyas', 'https://youtu.be/LV_cjS1shPU', 'สยองขวัญ', '93', 'พัชนนท์ ธรรมจิรา', 'show now'),
(6, 'Rudolf the black cat รูดอล์ฟ เหมียวน้อยผจญเมือง', 'รูดอล์ฟ แมวสีดำที่ต้องพลัดหลงจากบ้าน จนกลายมาเป็นแมวเร่ร่อนออกผจญภัยในเมืองใหญ่ โดยมีแมวลายเสือตัวใหญ่คอยเป็นพี่เลี้ยงในการใช้ชีวิตเอาตัวรอดในเมืองใหญ่นี้ ร่วมผจญภัยไปกับมิตรภาพระหว่างแมวสองตัว และความสนุกสนานเพื่อฝ่าฟันอุปสรรคไปให้ได้ รูดอล์ฟจะหาทางกลับบ้านได้ยังไง ความน่ารักแบบฉบับแมวแมว ที่จะมาพาคุณเดินทางไปพร้อมๆ กัน การผจญภัยของคู่ซี้ต่างไซส์ ที่ถูกวัดใจด้วยมิตรภาพ ไปเอาใจช่วยเขากันในโรงภาพยนตร์', 'http://movie.thaiware.com/upload_misc/movie/2016_10/original/161018120700u4p.jpg', 'https://youtu.be/14sXKG596AA', 'แอนิเมชัน', '89', 'Sakakibara Motonori and Yuyama Kunihiko', 'show now'),
(7, 'From Bangkok to Mandalay ถึงคน ไม่คิดถึง', 'ความคิดถึงของผู้ชายคนหนึ่ง นอนนิ่งอยู่ในซองจดหมายสิบฉบับที่ไม่เคยถูกเปิดอ่าน มันถูกส่งถึงผู้หญิงที่เขาเคยรัก เดินทางจากประเทศพม่าสู่ประเทศไทยและถูกซุกซ่อนไว้ลึกที่สุดจวบจนเวลาผ่านไปถึงครึ่งศตวรรษ  เมื่อ “ปิ่น”ได้พบจดหมายสิบฉบับจากพินัยกรรมของย่า ทำให้เธอตัดสินใจออกเดินทางไปยังประเทศพม่าเพื่อนำจดหมายเหล่านี้ไปเปิดอ่าน ณ ที่ที่มันถูกเขียนขึ้น ระหว่างการเดินทางปิ่นได้ขอร้อง“โมนาย” หนุ่มพม่าที่คุณย่าเขียนถึงในพินัยกรรมเป็นผู้นำทางเธอไปยังสถานที่บนจดหมายนั้น  เมื่อล้อรถเริ่มหมุนออกจากย่างกุ้ง ไม่มีใครรู้คำตอบล่วงหน้าจนกว่าจะได้เปิดอ่านหากความคิดถึงในกระดาษยังคงมีลมหายใจอยู่ บางทีจดหมายจากคนรักเก่าของย่าเหล่านี้ อาจทำให้ปิ่นได้เข้าใจอดีตที่ไม่เคยลืมของเธอและก้าวข้ามมันไปได้เสียที', 'http://f.ptcdn.info/464/046/000/oek6q7fmdHMV4ySmd2x-o.jpg', 'https://youtu.be/f-h8A47d-j0', 'ชีวิต / โรแมนติก', '-', 'ชาติชาย เกษนัส', 'show now'),
(8, 'In The Room ส่องห้องรัก', 'เอริก คู พาผู้ชมเดินทางกลับไปยังยุค 40 สมัยที่ญี่ปุ่นเข้ามายึดครองสิงคโปร์ ก่อนจะข้ามไปยังยุค 60 อันเป็นยุคสร้างเนื้อสร้างตัวของประเทศ จากนั้นก็สำรวจความบ้าคลั่งของยุค 70 ไล่เรื่อยมาจนถึงปัจจุบันนับรวม 7 ทศวรรษ ตัวละครที่ปรากฏอยู่ใน In the Room นั้นเป็นคนหลายชาติหลายภาษา แต่จุดร่วมหนึ่งเดียวของพวกเขาก็คือ พวกเขาเข้ามาพักที่ Hotel Singapura เพื่อ “ร่วมรัก” มันเป็นทั้งการร่วมรักที่เร่าร้อน, เร้นลับ, หฤหรรษ์, เศร้าสร้อย เป็นภาพบันทึกของความผิดหวัง และความทรงจำที่ขาดห้วง', 'http://s.img.kapook.com/photo/959/kapook_world-955870.jpg', 'https://youtu.be/PneRi3oHnOI', 'ชีวิต', '-', 'Eric Khoo', 'show now'),
(9, 'Ordinary World ร็อกให้พังค์ พังให้สุด', 'เพอร์รี่ (บิลลี่ โจ อาร์มสตรอง นักร้องนำวง Green Day ) อดีตนักร้องวงพังค์ร็อก ต้องเผชิญหน้ากับวิกฤตวัยกลางคนเมื่อภรรยาและลูกสาวของเขาจำวันเกิดไม่ได้ เขาจึงจัดงานวันเกิดครบรอบ 40 ปี ในโรงแรมที่เขาต้องเจอกับอดีตสมาชิกร่วมวงและผู้จัดการที่ต้องการให้เขากลับมาโด่งดังบนเส้นทางดนตรีอีกครั้ง', 'http://static.you2play.com/assets/uploads/news/images/original/c06fe7a7dc48da9d2ddea51b6ba7a077.jpg', 'https://youtu.be/Jm0jNlyx6bo', 'ตลก / ชีวิต', '86', 'Lee Kirk', 'show now'),
(10, 'Fantastic Beasts สัตว์มหัศจรรย์และถิ่นที่อยู่', 'เป็นการพูดถึงโลกเวทมนต์ ช่วงปี 1920 ในฝั่งของอเมริกา ก่อนการถือกำเนิดของแฮร์รี่ พอตเตอร์ 70 ปี ว่าด้วยเรื่องราวของ นิวตัน อาร์ทีมีส ไฟโด สคาแมนเดอร์ หรือ นิวท์ สคามันเดอร์ นักสัตว์วิเศษวิทยาแห่งโลกเวทมนตร์ของอังกฤษได้รับมอบหมายให้เดินทางไปยังนิวยอร์ค เพื่อทำบันทึกเกี่ยวกับสัตว์วิเศษต่างๆ และเขียนเป็นหนังสือ “สัตว์มหัศจรรย์และถิ่นที่อยู่” ซึ่งใช้เป็นหนังสือเรียนในยุคของแฮร์รี่ในเวลาต่อไป', 'http://www.metalbridges.com/wp-content/uploads/2016/10/Fantastic-Beasts-Credence_Poster-IMAX.jpg', 'https://youtu.be/9oeddZy_mNA', 'แฟนตาซี', '132', 'David Yates', 'coming soon'),
(11, 'Your Name หลับตาฝัน ถึงชื่อเธอ', 'เรื่องราวปาฏิหาริย์ระหว่างของคนสองคน มิตสึฮะ (โมเนะ  คามิชิราอิชิ )เด็กสาวผู้อาศัยอยู่ในชนบทแต่มีความฝันที่อยากไปใช้ชีวิตในเมืองกรุง และ ทากิ (ริวโนะสุเกะ คามิกิ )  เด็กหนุ่มในโตเกียวผู้ทำงานพิเศษที่ร้านอาหารอิตาเลียน และสนใจในงานด้านศิลปะ วันหนึ่ง มิตสึฮะได้ฝันว่าตัวเองกลายเป็นเด็กหนุ่ม ขณะที่ทากิฝันว่าตัวเองกลายเป็นเด็กสาวในชนบททั้งๆที่เขาไม่เคยไปมาก่อน ทั้งสองจึงต่างเดินทางเพื่อไขความลับของความฝัน จนกลายเป็นความผูกพันบางอย่าง', 'https://upload.wikimedia.org/wikipedia/th/5/5d/Your_Name_poster.jpg', 'https://youtu.be/mPsjLnEtJZI', 'แอนิเมชัน', '106', 'Makoto Shinkai', 'show now'),
(12, 'Death Note 2016 สมุดมรณะ', 'กว่า 10 ปีที่ห่างหายจากจอเงิน Death Note จะถูกสร้างเป็นภาพยนตร์ภาคต่อ โดยตอนนี้จะใช้ชื่ออย่างไม่เป็นทางการว่า Death Note 2016  สำหรับเรื่องราวนั้นจะมีการปรับเปลี่ยน “ตัวละครนำ” และ “ฉากหลัง” ของเหตุการณ์ที่เกิดขึ้น โดยหนังฉบับ 2016 นั้น จะมีฉากหลังเป็นยุคปัจจุบันที่โลกถูกคุกคามด้วยการก่อการร้ายทางโลกไซเบอร์อย่างสาหัส พร้อมกับมีตัวละครนำที่เป็น “ผู้สืบทอดดีเอ็นเอของไลท์ และแอล” ปรากฏตัวขึ้น ซึ่งบรรดาผู้สืบทอดเหล่านั้นจะต้องเข้าต่อสู้แย่งชิงสมุด โน้ตมรณะ หรือ เดธโน้ต ที่มีถึง 6 เล่มบนโลกมนุษย์นั่นเอง', 'https://4.bp.blogspot.com/-kIQT0IrqEAk/Vxrz584DLuI/AAAAAAAAAzw/hYO_agcwLrs9yeXKizkFp54w4Il855kXgCLcB/s1600/Death%2BNote%2B2016.jpg', 'https://youtu.be/YzoTzswobVU', 'แอ็คชัน / แฟนตาซี', '135', 'Shinsuke Sato', 'show now'),
(13, 'Ouija Origin of Evil กำเนิดกระดานปีศาจ', 'จากความสำเร็จของ Ouija (วีจี) กระดานผีกระชากวิญญาณ ภาพยนตร์ทุนต่ำที่เคยคว้าแชมป์บ็อกซ์ออฟฟิศและสามารถกวาดรายได้จากทั่วโลกมากกว่า 100 ล้านเหรียญ ปีนี้ เตรียมระทึกขวัญกับ Ouija: Origin of Evil กำเนิดกระดานปีศาจ ภาพยนตร์ทริลเลอร์เหนือธรรมชาติที่จะมาเขย่าโสตประสาทของคุณอีกครั้ง พบกับเรื่องราวของแม่ม่ายและลูกสาวสองคน ซึ่งทำมาหาเลี้ยงชีวิตด้วยธุรกิจหลอกลวงต้มตุ๋น ติดต่อกับภูติผีวิญญาณ พวกเขาได้เชิญปีศาจเข้าบ้านโดยไม่ได้ตั้งใจ ต่อมาลูกสาวคนเล็กถูกวิญญาณเข้าครอบงำ ครอบครัวนี้จึงต้องเผชิญกับความน่าสะพรึงกลัว และต้องช่วยให้เธอรอดพ้นจากการครอบงำของวิญญาณ', 'https://siam-movie.com/wp-content/uploads/2016/07/Ouija-2-2016.jpg', 'https://youtu.be/CC904nZIG1U', 'สยองขวัญ', '99', 'Mike Flanagan', 'show now'),
(14, 'Rong-Rean-Phee โรงเรียนผี', 'เงามืดในยามพลบค่ำของโรงเรียนและปรากฏการณ์มากมายที่นักเรียนในโรงเรียนผีแห่งนี้ยังหาคำตอบไม่ได้ และไม่มีใครอยากพิสูจน์ ในทุกๆวัน เงามืดนั้นอาจจับจ้องที่ใครบางคน และการมาของนักเรียนสุดซ่าที่เปี่ยมไปด้วยพลังและความสร้างสรรค์ มีความอยากรู้อยากเห็น และไม่เข้าใจว่าทำไมนักเรียนส่วนมากจึงรีบกลับบ้านจนเกินไป ไม่อยู่ทำกิจกรรมที่น่าสนใจหลังเลิกเรียน พวกเขามีความตั้งใจที่จะสร้างสมดุลระหว่างการเรียนและการเล่น พวกเขามีอารมณ์ขันและความตั้งใจอย่างเต็มเปี่ยมในการทำกิจกรรม ไม่ว่าจะเหน็ดเหนื่อยสักเพียงใด จนนำมาสู่ค่ำคืนที่พวกเขาต้องจดจำไปอีกนาน เงามืดนั้นปรากฏให้พวกเขาเห็น แต่ก็ยังไม่แน่ใจว่าคืออะไรกันแน่ และนักเรียนหญิงม.ปลาย ลึกลับ ที่ไม่ยอมบอกชั้นเรียนและชื่อของเธอ ใบหน้าเต็มไปด้วยความเศร้าหมอง ไม่ว่าพวกเขาจะพยายามสนุกสนานมากแค่ไหน และสายตาอันเย็นยะเยือกของเธอ จุดนี้เองทำให้พวกเขาได้รู้ว่าเธออาจไม่ใช่คน เมื่อกิจกรรมครั้งสำคัญใกล้เข้ามา การเรียนก็หนักหน่วง ในเกือบทุกคืนพวกเขาต้องเผชิญกับเงามืดที่มาปรากฏให้เห็นและสร้างความตกใจจนแทบคุมสติไม่อยู่ และเขาก็ต้องหาทางหนี ซึ่งทุกครั้งก็ต้องเผชิญหน้ากันอยู่ดี นอกจากความกลัวที่ต้องเชิญแล้ว ความฮาของการเอาตัวรอดก็เกิดขึ้นอีก พวกเขาจะทำอย่างไรกับเรื่องเล่าขานในโรงเรียนผีที่เป็นจริงและกำลังปรากฏต่อหน้าพวกเขา หรือนี่อาจเป็นการส่งข้อความบางอย่างให้พวกเขารับรู้และช่วยปลดปล่อยเงามืดนั้นให้ไปอยู่ในที่ๆดีกว่า', 'https://t1.gstatic.com/images?q=tbn:ANd9GcT1m0EZv3nHTNgpHbCgoHIzm74ONWcFdfYTXunV5puQxQiijBO7', 'https://youtu.be/MqI0iosSLrE', 'ตลก / สยองขวัญ', '98', 'มนัสนันท์ พงษ์สุวรรณ', 'show now'),
(15, 'the girl with all the gifts เชื้อนรกล้างซอมบี้', '"เว่าเรื่องราวในยุคล่มสลายของเผ่าพันธุ์มนุษย์ เมื่ออนาคต ประชากรกว่าครึ่งค่อนโลกกลายเป็นซอมบี้ออกอาละวาดขยายจำนวนมากมาย จนเข้าสู่ช่วงหัวเลี้ยวหัวต่อของการสูญพันธุ์ หนทางการอยู่รอดเดียว นอกจากการต่อสู้ฆ่าฟันโดยมีชีวิตเป็นเดิมพัน จึงเป็นการคิดค้นวัคซีนต้านเชื้อนรกนี้ และหนึ่งในแผนการเหล่านั้นก็ “กลุ่มเด็กพิเศษ” ผู้ติดเชื้อและยังไม่แสดงอาการที่ถูกดูแลในค่ายทดลองหนึ่ง บริเวณพื้นที่ห่างไกลของอังกฤษ ที่เป็นเหมือนความหวังเดียวที่มนุษย์หลงเหลืออยู่ เมลานี (Melanie) คือ เด็กพิเศษหนึ่งในกลุ่มนั้น ต่างก็ตรง… เธอมีความรู้สึกนึกคิด รอบรู้ เฉลียวฉลาด และควบคุมตัวเองได้เหมือนเด็กหญิงธรรมดา อีกทั้งยังไม่หวั่นไหวต่อสัญชาติญาณที่อาจถูกปลุกเร้า เช่น การได้กลิ่นมนุษย์ใกล้ๆ จนเกิดความกระหายคลุ้งคลั่งเหมือนเด็กพิเศษคนอื่นๆ จนกระทั่งความแตกต่างของเธอถูกมองเห็น และเฝ้าติดตาม จนเกิดเป็นความรักใคร่เอ็นดูที่ เฮเลน (Helen Justineau) ครูผู้ดูแลสาวมีต่อเธอ และก็ด้วยเพราะสถานการณ์อันตรายจากการจู่โจมของฝูงซอมบี้ ที่เมลานีเสี่ยงชีวิตช่วยเฮเลน ยิ่งเป็นการพิสูจน์ว่า เด็กหญิงสามารถเป็นที่ไว้วางใจได้เพียงใด แต่นั่น “ไม่ใช่” สำหรับกองทัพ รวมถึงนักชีววิทยาผู้ดูแลการทดลองนี้อย่าง ดร.แคโรลีน (Caroline Caldwell) ที่ยังคงมองเมลานีเป็นเพียงสิ่งมีชีวิตอันตรายที่ใช้เป็นเครื่องมือ เพื่อช่วยชีวิตผู้บริสุทธิ์ตามความเชื่อของพวกเขา', 'http://www.metalbridges.com/wp-content/uploads/2016/10/The-Girl-With-All-The-Gifts-poster.jpg', 'https://youtu.be/J9ZLzyFcF-s', 'ชีวิต', '111', 'Colm McCarthy', 'show now'),
(16, 'L.O.R.D. สงคราม 7 จอมเวทย์', '"เรื่องราวการต่อสู้แย่งชิงอำนาจสูงสุด สู่การเป็นมหาจอมเวทย์ (โนเบิล ลอร์ด) ของเหล่าจอมเวทย์วิญญาณ (ลอร์ด) ทั้ง 7 ในดินแดนที่มีชื่อว่า “โอดิน” อันประกอบด้วย 4 อาณาจักรใหญ่ ได้แก่… ดิน – อาณาจักร Garcia (กว้างใหญ่และลึกลับที่สุด) น้ำ – อาณาจักร Aslan ลม – อาณาจักร Inde ไฟ – อาณาจักร Foliaier ทั้งนี้ มหากาพย์การผจญภัยได้เกิดขึ้นบนฉากหลังของสงครามระหว่างผู้วิเศษ ลอร์ด และสัตว์อสูร เมื่อเด็กหนุ่มไร้ประสบการณ์แต่แฝงไว้ด้วยพลังอันยิ่งใหญ่อย่าง Chen Xuedong (ฉีหลิง) ได้รับการชี้นำทางสู่การเดินทางอันน่าอัศจรรย์ ในหนทางการเป็นสาวกแห่งลอร์ด แต่กลับพบความจริงแห่งการคงอยู่ของบุคคลที่เชื่อว่าตายไปแล้ว อีกทั้งยังเป็นตัวแปรสำคัญแห่งประวัติศาสตร์ สงครามแห่งเหล่าผู้วิเศษจึงอุบัติขึ้น ผู้แข็งแกร่งและมีไหวพริบที่สุดเท่านั้น จึงจะคู่ควรกับมหาจอมเวทย์เท่านั้นจริงหรือ?', 'http://www.metalbridges.com/wp-content/uploads/2016/09/L.O.R.D-Legend-of-Ravaging-Dynasties-poster.jpg', 'https://youtu.be/jCZXjMGl3DE', 'แฟนตาซี', '117', 'Guo Jingming', 'show now'),
(17, 'Magnificent Seven 7 สิงห์แดนเสือ', 'เรื่องราวของ The Magnificent Seven เกิดขึ้นเมื่อหมู่บ้านเล็ก ๆ อย่าง โรสครีก ตกอยู่ภายใต้การปกครองของอันธพาล จนทำให้ชาวบ้านผู้สิ้นหวังต้องว่าจ้าง 7 มือปืนนอกกฎหมายมาช่วยคุ้มครองพวกเขา แต่ในระหว่างที่ 7 มือปืนกำลังเตรียมการเปิดศึกครั้งสำคัญ พวกเขาค้นพบว่ากำลังต่อสู้เพื่อเป้าหมายบางอย่างนอกเหนือจากค่าจ้าง', 'http://img.kapook.com/u/2016/pailin_p/9992_Movie/Mag7Movie.jpg', 'https://youtu.be/QYv1BJ5Q48Y', 'แอ็คชัน', '133', 'Antoine Fuqua', 'show now'),
(18, 'suddenly twenty 20 ใหม่ ยูเทิร์นวัย หัวใจรีเทิร์น', 'ปาน คุณย่าวัย 74 ปี ทั้งหัวดื้อและขี้โวยวาย ครอบครัวของเธอวางแผนส่งตัวคุณย่าไปอยู่บ้านพักคนชรา ย่าปาน ออกจากบ้านไปด้วยความเศร้าและผิดหวัง เธอเดินเรื่อยเปื่อยจนไปเจอร้านถ่ายภาพแห่งหนึ่งชื่อ “ฉายารำลึก” ย่าปาน ตัดสินใจเข้าไปในร้านเพื่อถ่ายรูปตั้งใจว่าจะเป็นภาพสุดท้ายของตน แต่เมื่อออกมาจากร้าน เธอต้องตะลึงที่เห็นตัวเองหน้าตากลับย้อนไปเหมือนเธออายุ 20 ปีอีกครั้ง จากนั้นชีวิตของเธอก็เปลี่ยนไป เธออยากใช้ชีวิตให้สดใสและอิสระแต่อีกใจก็อยากกลับไปสานสัมพันธ์กับครอบครัว ด้วยเหตุนี้ ย่าปานจึงเปลี่ยนชื่อเป็น ป่าน (ดาวิกา โฮร์เน่) และเข้าร่วมวงดนตรีกับ บูม (เจเจ กฤษณภูมิ พิบูลสงคราม) หลานชายของเธอ โดยมี นัท (สหรัถ สังคปรีชา) โปรดิวเซอร์หนุ่มเจ้าของรายการโทรทัศน์ ที่เห็นความสามารถอันแตกต่างจากนักร้องคนอื่น ๆ ของป่าน จึงพยายามผลักดันวงดนตรีนี้ให้โด่งดัง', 'http://www.majorcineplex.com/uploads/movie/1727/thumb_1727.jpg', 'https://youtu.be/EoA7yJK2gbQ', 'ตลก / โรแมนติก', '-', '-', 'coming soon'),
(19, 'Trolls', 'เรื่องราวสนุกสุดฮากวนโอ๊ยเกี่ยวกับการค้นหาความสุขและการดิ้นรนเพื่อให้ได้ความสุขนั้นมา หนังเรื่องนี้นำผู้ชมไปสู่โลกมหัศจรรย์สีสันสดใส อันเป็นที่อยู่อาศัยของเหล่าโทรลล์ผู้มองโลกในแง่ดีเกินไปและเอาแต่ร้องรำทำเพลงกันทั้งวันทั้งคืน กับเหล่าเบอร์เกนผู้มองโลกในแง่ร้ายจนน่าขันและจะมีความสุขได้ก็ต่อเมื่อมีตัวโทรลล์อยู่ในท้องเท่านั้น หลังจากเบอร์เกนบุกโจมตีหมู่บ้านโทรลล์ ป๊อปปี (แอนนา เคนดริค) โทรลล์ผู้มีความสุขที่สุดในโลก กับแบรนช์ (จัสติน ทิมเบอร์เลค) โทรลล์จอมหวาดระแวงที่อารมณ์เสียตลอดเวลา จึงได้ร่วมกันออกเดินทางไปช่วยเหลือเพื่อนๆ ภารกิจครั้งนี้เต็มไปด้วยการผจญภัยและเรื่องวุ่นๆ ขณะที่คู่หูต่างขั้วคู่นี้ต้องพยายามอดทนกับอีกฝ่ายเพื่อทำงานให้สำเร็จ', 'http://www.nangdee.com/photoThumbnail/mposters/m4399t/trolls_ver_7FmENEWThu95402.jpg', 'https://youtu.be/cuBgfhGhQl0', 'แอนิเมชัน', '92', 'Mike Mitchell, Walt Dohrn', 'coming soon'),
(20, 'A Monster Calls มหัศจรรย์เรียกอสูร', 'เรื่องราวสุดลี้ลับอัศจรรย์ของเด็กชายวัย 13 ปี คอเนอร์ โอ มาลลีย์ (ลูอิส แม็คดูกัลล์) ที่พยายามรับมือกับการถูกเพื่อนกลั่นแกล้งในโรงเรียน และการช่วยเหลือแม่ (เฟลิซิตี้ โจนส์) ที่ป่วยเป็นมะเร็งระยะสุดท้าย กระทั่งค่ำคืนหนึ่งเขาได้พบกับสัตว์ประหลาดต้นไม้ยักษ์ (เลียม นีสัน) ที่นำพาเข้าไปในดินแดนเหนือจินตนาการ สถานที่แห่งนั้นเขาจะได้พบกับการเรียนรู้ ไม่ว่าจะเป็นการเสียสละและการสูญเสียซึ่งจะทำให้เปลี่ยนแปลงโลกแห่งความจริงของเขาไปตลอดกาล', 'http://www.nangdee.com/photoThumbnail/mposters/m4327t/monster_ca_ZZZ3OcvFri51417.jpg', 'https://youtu.be/f4wpwqgbKc8', 'ชีวิต / แฟนตาซี', '108', 'J.A. Bayona', 'coming soon');

-- --------------------------------------------------------

--
-- Table structure for table `showtime`
--

CREATE TABLE IF NOT EXISTS `showtime` (
  `shtid` int(11) NOT NULL,
  `mid` int(11) NOT NULL,
  `tid` int(11) NOT NULL,
  `shttime` text NOT NULL,
  `language` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `showtime`
--

INSERT INTO `showtime` (`shtid`, `mid`, `tid`, `shttime`, `language`) VALUES
(1, 1, 1, '', 'TH/TH'),
(2, 2, 2, '', 'TH/TH'),
(3, 3, 3, '', 'TH/TH'),
(4, 4, 4, '', 'TH/TH');

-- --------------------------------------------------------

--
-- Table structure for table `theatre`
--

CREATE TABLE IF NOT EXISTS `theatre` (
  `tid` int(11) NOT NULL,
  `tname` text NOT NULL,
  `cid` int(11) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `theatre`
--

INSERT INTO `theatre` (`tid`, `tname`, `cid`) VALUES
(1, 'Theatre 1', 1),
(2, 'Theatre 2', 1),
(3, 'Theatre 3', 1),
(4, 'Theatre 4', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cinema`
--
ALTER TABLE `cinema`
  ADD PRIMARY KEY (`cid`);

--
-- Indexes for table `movie`
--
ALTER TABLE `movie`
  ADD PRIMARY KEY (`mid`);

--
-- Indexes for table `showtime`
--
ALTER TABLE `showtime`
  ADD PRIMARY KEY (`shtid`);

--
-- Indexes for table `theatre`
--
ALTER TABLE `theatre`
  ADD PRIMARY KEY (`tid`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `cinema`
--
ALTER TABLE `cinema`
  MODIFY `cid` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `movie`
--
ALTER TABLE `movie`
  MODIFY `mid` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=21;
--
-- AUTO_INCREMENT for table `showtime`
--
ALTER TABLE `showtime`
  MODIFY `shtid` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT for table `theatre`
--
ALTER TABLE `theatre`
  MODIFY `tid` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
